_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_2 (LSTM)                (None, 20)                3680      
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 21        
=================================================================
Total params: 3,701
Trainable params: 3,701
Non-trainable params: 0
_________________________________________________________________
