_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
cu_dnnlstm_5 (CuDNNLSTM)     (None, 10, 20)            29440     
_________________________________________________________________
dropout_1 (Dropout)          (None, 10, 20)            0         
_________________________________________________________________
cu_dnnlstm_6 (CuDNNLSTM)     (None, 20)                3360      
_________________________________________________________________
dropout_2 (Dropout)          (None, 20)                0         
_________________________________________________________________
dense_7 (Dense)              (None, 10)                210       
_________________________________________________________________
dense_8 (Dense)              (None, 1)                 11        
=================================================================
Total params: 33,021
Trainable params: 33,021
Non-trainable params: 0
_________________________________________________________________
