_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
cu_dnnlstm_3 (CuDNNLSTM)     (None, 25, 20)            29440     
_________________________________________________________________
cu_dnnlstm_4 (CuDNNLSTM)     (None, 20)                3360      
_________________________________________________________________
dense_7 (Dense)              (None, 10)                210       
_________________________________________________________________
dense_8 (Dense)              (None, 1)                 11        
=================================================================
Total params: 33,021
Trainable params: 33,021
Non-trainable params: 0
_________________________________________________________________
