_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
bidirectional_1 (Bidirection (None, 20, 20)            2880      
_________________________________________________________________
dropout_3 (Dropout)          (None, 20, 20)            0         
_________________________________________________________________
bidirectional_2 (Bidirection (None, 20)                2480      
_________________________________________________________________
dropout_4 (Dropout)          (None, 20)                0         
_________________________________________________________________
dense_5 (Dense)              (None, 1)                 21        
=================================================================
Total params: 5,381
Trainable params: 5,381
Non-trainable params: 0
_________________________________________________________________
