_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
bidirectional_3 (Bidirection (None, 15, 40)            7360      
_________________________________________________________________
dropout_8 (Dropout)          (None, 15, 40)            0         
_________________________________________________________________
bidirectional_4 (Bidirection (None, 15, 40)            9760      
_________________________________________________________________
dropout_9 (Dropout)          (None, 15, 40)            0         
_________________________________________________________________
bidirectional_5 (Bidirection (None, 40)                9760      
_________________________________________________________________
dropout_10 (Dropout)         (None, 40)                0         
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 41        
=================================================================
Total params: 26,921
Trainable params: 26,921
Non-trainable params: 0
_________________________________________________________________
