_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
bidirectional_5 (Bidirection (None, 20, 40)            42720     
_________________________________________________________________
dropout_10 (Dropout)         (None, 20, 40)            0         
_________________________________________________________________
bidirectional_6 (Bidirection (None, 20, 40)            9760      
_________________________________________________________________
dropout_11 (Dropout)         (None, 20, 40)            0         
_________________________________________________________________
bidirectional_7 (Bidirection (None, 40)                9760      
_________________________________________________________________
dropout_12 (Dropout)         (None, 40)                0         
_________________________________________________________________
dense_15 (Dense)             (None, 10)                410       
_________________________________________________________________
dense_16 (Dense)             (None, 1)                 11        
=================================================================
Total params: 62,661
Trainable params: 62,661
Non-trainable params: 0
_________________________________________________________________
