_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
bidirectional_10 (Bidirectio (None, 25, 200)           358400    
_________________________________________________________________
dropout_15 (Dropout)         (None, 25, 200)           0         
_________________________________________________________________
bidirectional_11 (Bidirectio (None, 200)               241600    
_________________________________________________________________
dropout_16 (Dropout)         (None, 200)               0         
_________________________________________________________________
dense_19 (Dense)             (None, 100)               20100     
_________________________________________________________________
dense_20 (Dense)             (None, 1)                 101       
=================================================================
Total params: 620,201
Trainable params: 620,201
Non-trainable params: 0
_________________________________________________________________
