_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
bidirectional_4 (Bidirection (None, 15, 40)            7360      
_________________________________________________________________
dropout_4 (Dropout)          (None, 15, 40)            0         
_________________________________________________________________
bidirectional_5 (Bidirection (None, 15, 40)            9760      
_________________________________________________________________
dropout_5 (Dropout)          (None, 15, 40)            0         
_________________________________________________________________
bidirectional_6 (Bidirection (None, 40)                9760      
_________________________________________________________________
dropout_6 (Dropout)          (None, 40)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 41        
=================================================================
Total params: 26,921
Trainable params: 26,921
Non-trainable params: 0
_________________________________________________________________
