_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
bidirectional_5 (Bidirection (None, 25, 40)            58880     
_________________________________________________________________
dropout_10 (Dropout)         (None, 25, 40)            0         
_________________________________________________________________
bidirectional_6 (Bidirection (None, 25, 40)            9920      
_________________________________________________________________
dropout_11 (Dropout)         (None, 25, 40)            0         
_________________________________________________________________
bidirectional_7 (Bidirection (None, 40)                9920      
_________________________________________________________________
dropout_12 (Dropout)         (None, 40)                0         
_________________________________________________________________
dense_17 (Dense)             (None, 10)                410       
_________________________________________________________________
dense_18 (Dense)             (None, 1)                 11        
=================================================================
Total params: 79,141
Trainable params: 79,141
Non-trainable params: 0
_________________________________________________________________
