_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_11 (LSTM)               (None, 25, 20)            3680      
_________________________________________________________________
dropout_7 (Dropout)          (None, 25, 20)            0         
_________________________________________________________________
lstm_12 (LSTM)               (None, 25, 20)            3280      
_________________________________________________________________
dropout_8 (Dropout)          (None, 25, 20)            0         
_________________________________________________________________
lstm_13 (LSTM)               (None, 20)                3280      
_________________________________________________________________
dropout_9 (Dropout)          (None, 20)                0         
_________________________________________________________________
dense_7 (Dense)              (None, 1)                 21        
=================================================================
Total params: 10,261
Trainable params: 10,261
Non-trainable params: 0
_________________________________________________________________
