_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_3 (LSTM)                (None, 20, 20)            3680      
_________________________________________________________________
lstm_4 (LSTM)                (None, 20)                3280      
_________________________________________________________________
dense_3 (Dense)              (None, 1)                 21        
=================================================================
Total params: 6,981
Trainable params: 6,981
Non-trainable params: 0
_________________________________________________________________
