_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
bidirectional_3 (Bidirection (None, 15, 40)            7360      
_________________________________________________________________
dropout_5 (Dropout)          (None, 15, 40)            0         
_________________________________________________________________
bidirectional_4 (Bidirection (None, 40)                9760      
_________________________________________________________________
dropout_6 (Dropout)          (None, 40)                0         
_________________________________________________________________
dense_6 (Dense)              (None, 1)                 41        
=================================================================
Total params: 17,161
Trainable params: 17,161
Non-trainable params: 0
_________________________________________________________________
