_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
bidirectional_7 (Bidirection (None, 15, 40)            7360      
_________________________________________________________________
dropout_7 (Dropout)          (None, 15, 40)            0         
_________________________________________________________________
bidirectional_8 (Bidirection (None, 15, 40)            9760      
_________________________________________________________________
dropout_8 (Dropout)          (None, 15, 40)            0         
_________________________________________________________________
bidirectional_9 (Bidirection (None, 40)                9760      
_________________________________________________________________
dropout_9 (Dropout)          (None, 40)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 1)                 41        
=================================================================
Total params: 26,921
Trainable params: 26,921
Non-trainable params: 0
_________________________________________________________________
