_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 20, 20)            1020      
_________________________________________________________________
flatten_1 (Flatten)          (None, 400)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 401       
=================================================================
Total params: 1,421
Trainable params: 1,421
Non-trainable params: 0
_________________________________________________________________
