_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
bidirectional_1 (Bidirection (None, 20, 20)            4880      
_________________________________________________________________
dropout_3 (Dropout)          (None, 20, 20)            0         
_________________________________________________________________
bidirectional_2 (Bidirection (None, 20)                2480      
_________________________________________________________________
dropout_4 (Dropout)          (None, 20)                0         
_________________________________________________________________
dense_9 (Dense)              (None, 10)                210       
_________________________________________________________________
dense_10 (Dense)             (None, 1)                 11        
=================================================================
Total params: 7,581
Trainable params: 7,581
Non-trainable params: 0
_________________________________________________________________
