_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 25, 20)            6940      
_________________________________________________________________
flatten_1 (Flatten)          (None, 500)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 501       
=================================================================
Total params: 7,441
Trainable params: 7,441
Non-trainable params: 0
_________________________________________________________________
