_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
bidirectional_8 (Bidirection (None, 10, 40)            58880     
_________________________________________________________________
dropout_13 (Dropout)         (None, 10, 40)            0         
_________________________________________________________________
bidirectional_9 (Bidirection (None, 40)                9920      
_________________________________________________________________
dropout_14 (Dropout)         (None, 40)                0         
_________________________________________________________________
dense_17 (Dense)             (None, 20)                820       
_________________________________________________________________
dense_18 (Dense)             (None, 1)                 21        
=================================================================
Total params: 69,641
Trainable params: 69,641
Non-trainable params: 0
_________________________________________________________________
