_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
bidirectional_1 (Bidirection (None, 40, 40)            58880     
_________________________________________________________________
dropout_1 (Dropout)          (None, 40, 40)            0         
_________________________________________________________________
bidirectional_2 (Bidirection (None, 40)                9920      
_________________________________________________________________
dropout_2 (Dropout)          (None, 40)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 20)                820       
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 21        
=================================================================
Total params: 69,641
Trainable params: 69,641
Non-trainable params: 0
_________________________________________________________________
