_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
bidirectional_3 (Bidirection (None, 20, 40)            18720     
_________________________________________________________________
dropout_5 (Dropout)          (None, 20, 40)            0         
_________________________________________________________________
bidirectional_4 (Bidirection (None, 40)                9760      
_________________________________________________________________
dropout_6 (Dropout)          (None, 40)                0         
_________________________________________________________________
dense_11 (Dense)             (None, 10)                410       
_________________________________________________________________
dense_12 (Dense)             (None, 1)                 11        
=================================================================
Total params: 28,901
Trainable params: 28,901
Non-trainable params: 0
_________________________________________________________________
