_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
bidirectional_5 (Bidirection (None, 20, 40)            7360      
_________________________________________________________________
dropout_10 (Dropout)         (None, 20, 40)            0         
_________________________________________________________________
bidirectional_6 (Bidirection (None, 20, 40)            9760      
_________________________________________________________________
dropout_11 (Dropout)         (None, 20, 40)            0         
_________________________________________________________________
bidirectional_7 (Bidirection (None, 40)                9760      
_________________________________________________________________
dropout_12 (Dropout)         (None, 40)                0         
_________________________________________________________________
dense_10 (Dense)             (None, 1)                 41        
=================================================================
Total params: 26,921
Trainable params: 26,921
Non-trainable params: 0
_________________________________________________________________
