_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
bidirectional_3 (Bidirection (None, 25, 40)            58880     
_________________________________________________________________
dropout_5 (Dropout)          (None, 25, 40)            0         
_________________________________________________________________
bidirectional_4 (Bidirection (None, 40)                9920      
_________________________________________________________________
dropout_6 (Dropout)          (None, 40)                0         
_________________________________________________________________
dense_11 (Dense)             (None, 10)                410       
_________________________________________________________________
dense_12 (Dense)             (None, 1)                 11        
=================================================================
Total params: 69,221
Trainable params: 69,221
Non-trainable params: 0
_________________________________________________________________
