_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_11 (LSTM)               (None, 20, 20)            9360      
_________________________________________________________________
dropout_7 (Dropout)          (None, 20, 20)            0         
_________________________________________________________________
lstm_12 (LSTM)               (None, 20, 20)            3280      
_________________________________________________________________
dropout_8 (Dropout)          (None, 20, 20)            0         
_________________________________________________________________
lstm_13 (LSTM)               (None, 20)                3280      
_________________________________________________________________
dropout_9 (Dropout)          (None, 20)                0         
_________________________________________________________________
dense_13 (Dense)             (None, 10)                210       
_________________________________________________________________
dense_14 (Dense)             (None, 1)                 11        
=================================================================
Total params: 16,141
Trainable params: 16,141
Non-trainable params: 0
_________________________________________________________________
