_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
bidirectional_3 (Bidirection (None, 20, 40)            11360     
_________________________________________________________________
dropout_5 (Dropout)          (None, 20, 40)            0         
_________________________________________________________________
bidirectional_4 (Bidirection (None, 40)                9760      
_________________________________________________________________
dropout_6 (Dropout)          (None, 40)                0         
_________________________________________________________________
dense_8 (Dense)              (None, 1)                 41        
=================================================================
Total params: 21,161
Trainable params: 21,161
Non-trainable params: 0
_________________________________________________________________
