_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_3 (LSTM)                (None, 15, 20)            3680      
_________________________________________________________________
dropout_3 (Dropout)          (None, 15, 20)            0         
_________________________________________________________________
lstm_4 (LSTM)                (None, 15, 20)            3280      
_________________________________________________________________
dropout_4 (Dropout)          (None, 15, 20)            0         
_________________________________________________________________
lstm_5 (LSTM)                (None, 20)                3280      
_________________________________________________________________
dropout_5 (Dropout)          (None, 20)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 21        
=================================================================
Total params: 10,261
Trainable params: 10,261
Non-trainable params: 0
_________________________________________________________________
