_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
cu_dnnlstm_11 (CuDNNLSTM)    (None, 10, 20)            29440     
_________________________________________________________________
dropout_7 (Dropout)          (None, 10, 20)            0         
_________________________________________________________________
cu_dnnlstm_12 (CuDNNLSTM)    (None, 10, 20)            3360      
_________________________________________________________________
dropout_8 (Dropout)          (None, 10, 20)            0         
_________________________________________________________________
cu_dnnlstm_13 (CuDNNLSTM)    (None, 20)                3360      
_________________________________________________________________
dropout_9 (Dropout)          (None, 20)                0         
_________________________________________________________________
dense_13 (Dense)             (None, 10)                210       
_________________________________________________________________
dense_14 (Dense)             (None, 1)                 11        
=================================================================
Total params: 36,381
Trainable params: 36,381
Non-trainable params: 0
_________________________________________________________________
